package lesson6;

public class Lesson6 {
    public static void main(String[] args) {
    // имя класса формируется из имени пакета потом имя класса для данного класса lesson6.Lesson6
        // для использования др класса используется import."имя класса"
        //пакет именуется имя компании наоборот ru(com, org).имякомпаниию.имяпакета
        // для использование используем полное имя new lesson6.Lesson6 если у классов одинаковое имя
        //для создания объекта необходимо сначала создать класс и перечислить его характериски(свойства) и методы
        // TODO: 16.03.20 в одном классе описывается один обхект!!


        // библиотека:
            //можно ли добавлять книги по одной или несколько сразу
            // можно ли взять книгу(указав автора)
            // домой /для чтения в библиотеке
        // книги:
            //для каждой книиги указать название,
            // количество страниц,
            // автор (имя фамилия),
            // можно ли брать домой
            // доступна ли для выдачи

        // TODO: 16.03.20 Значения по умолчанию
        // ссылочные типы null
        // целые числа 0
        //boolean false
        // числа с плавающей точкой 0.0

    }
}
